// Map — это коллекция ключ/значение, как и Object. Но основное отличие в том, чтоMap позволяет использовать ключи любого типа.

// let map = new Map(); // создали колекцию

// map.set("1", "str1"); //строка в качестве ключа
// map.set(1, "num1"); //цифра как  ключа
// map.set(true, "bool1"); //булево значение как ключ
// console.log(map);

// // помните, обычный объект Object приводит ключи к строкам
// // Мар сохраняет тип ключей, так что в этом случае сохраниться 2 разных значения:
// console.log(map.get(1)); // 'num1'
// console.log(map.get("1")); // 'str1'
// console.log(map.size); // 3

////----- get set ---------

// let map = new Map();
// map.set("1", "We").set(1, "likes").set(true, "JS");

// console.log(map);

// Перебор коллекции Мар

// let recipeMap = new Map([
// 	["огурец", 500],
// 	["помидор", 350],
// 	["лук", 50],
// ]);

// console.log(recipeMap);

// // перебор по ключам (овощи)
// for (let vegetable of recipeMap.keys()) {
// 	console.log(vegetable);
// }

// // перебор по значениям (число)
// for (let amount of recipeMap.values()) {
// 	console.log(amount);
// }

// // перебор по элементам в формате [ключ, значение]
// for (let entry of recipeMap) {
// 	// то же самое, что и recipeMap.entries()
// 	console.log(entry);
// }

// // выполняем функцию для каждой пары (ключ, значение)
// recipeMap.forEach((value, key, map) => {
// 	console.log(`${key}: ${value}`);
// });

///---------Работа с объектами-------

// //Object.entries поможет создать Мар:
// let map = new Map(Object.entries(obj));
// //Object.fromEntries поможет создать объект из Мар
// let obj = Object.fromEntries(map);

// --------------- Set ------------------
let buddies = [
    'Жучка',
    'Тузик',
    'Булька',
    'Тузик',
    'Бобик',
    'Жучка',
    'Валера',
    'Жучка',
    'Тузик',
    'Манька'
];

let uniqueBuddies = new Set(buddies);
console.log(uniqueBuddies); // Set(6) {'Жучка', 'Тузик', 'Булька', 'Бобик', 'Валера', …} убрали дубликаты

let arr = Array.from(uniqueBuddies);
console.log(arr); // (6) ['Жучка', 'Тузик', 'Булька', 'Бобик', 'Валера', 'Манька'] сделали массив

// new Map() – создаёт коллекцию.
// 💡 map.set(key, value) – записывает по ключу key значение value.
// 💡 map.get(key) – возвращает значение по ключу или undefined, если ключ key отсутствует.
// 💡 map.has(key) – возвращает true, если ключ key присутствует в коллекции, иначе false.
// 💡 map.delete(key) – удаляет элемент (пару «ключ/значение») по ключу key.
// 💡 map.clear() – очищает коллекцию от всех элементов.
// 💡 map.size – возвращает текущее количество элементов.

// new Set(iterable) – создаёт Set, и если в качестве аргумента был предоставлен итерируемый объект
// (обычно это массив), то копирует его значения в новый Set
// 💡 set.add(value) – добавляет значение (если оно уже есть, то ничего не делает), возвращает тот же
// объект set
// 💡 set.delete(value) – удаляет значение, возвращает true, если value было в множестве на момент
// вызова, иначе false.
// 💡 set.has(value) – возвращает true, если значение присутствует в множестве, иначе false
// 💡 set.clear() – удаляет все имеющиеся значения
// 💡 set.size – возвращает количество элементов в множестве

// 💡 keys() – возвращает итерируемый объект по ключам,
// 💡 values() – возвращает итерируемый объект по значениям,
// 💡 entries() – возвращает итерируемый объект по парам вида [ключ, значение],
// этот вариант используется по умолчанию в for(..of..).
// 💡 forEach() – итератор, работающий так же, как и с массивом